### Part of day 5 notebook

In [137]:
import numpy as np
import pandas as pd

In [138]:
df = pd.read_csv("Supermarket Sales 2.csv")   # read CSV
df

,Date,Branch,Customer type,Gender,Product line,Unit price,Quantity,Payment,Rating
0,1/1/2024,Brooklyn,Member,Female,Food & Beverages,84.63,10,Credit card,9.0
1,1/1/2024,Queens,Normal,Female,Electronics,63.22,2,Cash,8.5
2,1/1/2024,Brooklyn,Normal,Female,Electronics,74.71,6,Cash,6.7
3,1/1/2024,Queens,Member,Female,Sports & Travel,36.98,10,Credit card,7.0
4,1/1/2024,Manhattan,Member,Female,Sports & Travel,27.04,4,Ewallet,6.9
...,...,...,...,...,...,...,...,...,...
5048,12/31/2024,Manhattan,Normal,Female,Food & Beverages,6.71,10,Cash,5.9
5049,12/31/2024,Brooklyn,Normal,Male,Food & Beverages,6.79,9,Credit card,4.8
5050,12/31/2024,Queens,Member,Male,Electronics,85.05,7,Ewallet,4.4
5051,12/31/2024,Manhattan,Member,Female,Sports & Travel,54.64,10,Credit card,4.8
5052,12/31/2024,Queens,Normal,Female,Health & Beauty,49.75,7,Cash,5.8

In [ ]:
df

In [139]:
from datetime import datetime

In [ ]:
df

In [ ]:
ans = datetime.strptime(df['Date'][1046],"%m/%d/%Y").strftime("%d-%m-%Y")  # it change only one columns date in our formate

In [ ]:
ans

In [ ]:
all_date = []
for date in df["Date"] :
    all_date.append(datetime.strptime(date,"%m/%d/%Y").strftime("%d-%m-%Y"))

In [ ]:
date_series = pd.Series(all_date)
print(date_series)                           # it change only one columns date in our formate

In [ ]:
df["Date"] = date_series

In [ ]:
df["Date"]

In [ ]:
df["Date"].head()

In [ ]:
df["Date"].head(10)

In [ ]:
df["Date"].tail()

In [ ]:
df["Date"].tail(10)

In [140]:
df

,Date,Branch,Customer type,Gender,Product line,Unit price,Quantity,Payment,Rating
0,1/1/2024,Brooklyn,Member,Female,Food & Beverages,84.63,10,Credit card,9.0
1,1/1/2024,Queens,Normal,Female,Electronics,63.22,2,Cash,8.5
2,1/1/2024,Brooklyn,Normal,Female,Electronics,74.71,6,Cash,6.7
3,1/1/2024,Queens,Member,Female,Sports & Travel,36.98,10,Credit card,7.0
4,1/1/2024,Manhattan,Member,Female,Sports & Travel,27.04,4,Ewallet,6.9
...,...,...,...,...,...,...,...,...,...
5048,12/31/2024,Manhattan,Normal,Female,Food & Beverages,6.71,10,Cash,5.9
5049,12/31/2024,Brooklyn,Normal,Male,Food & Beverages,6.79,9,Credit card,4.8
5050,12/31/2024,Queens,Member,Male,Electronics,85.05,7,Ewallet,4.4
5051,12/31/2024,Manhattan,Member,Female,Sports & Travel,54.64,10,Credit card,4.8
5052,12/31/2024,Queens,Normal,Female,Health & Beauty,49.75,7,Cash,5.8

- pandas only accept universal formate

In [145]:
df["Date"] = pd.to_datetime(df["Date"])   # convert datetime type
df["Date"]

0      2024-01-01
1      2024-01-01
2      2024-01-01
3      2024-01-01
4      2024-01-01
          ...
5048   2024-12-31
5049   2024-12-31
5050   2024-12-31
5051   2024-12-31
5052   2024-12-31
Name: Date, Length: 5053, dtype: datetime64[ns]